#область ПрограмныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт  
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда  
		
		ДобавитьПолеКонтекстноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСкидкиИКнопкуПересчета(Форма)
		
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтекстноеЛицоВГруппаШапкаПраво(Форма);
		
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтекстноеЛицоВГруппаШапкаПраво(Форма); 
		
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда   
		
		ВставитьПолеКонтактноеЛицоНаФормеПередСуммаДокумента(Форма)    
		
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		
		ВставитьПолеКонтактноеЛицоНаФормеПередСуммаДокумента(Форма)    
		
	КонецЕсли;
	
КонецПроцедуры   
#КонецОбласти

#Область СлужебныйпрограмныйИнтерфейс 

Процедура ДобавитьПолеКонтекстноеЛицоВГруппаШапкаПраво (Форма) 
	
	ПолеВВода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормеПередСуммаДокумента(Форма) 
	
	ПолеВВода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеСкидкиИКнопкуПересчета(Форма)   
	
	ГруппаСкидки = Форма.Элементы.Добавить("ГруппаСкидки", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;                   
	ГруппаСкидки.Отображение = ОтображениеОбычнойГруппы.Нет;   
	ГруппаСкидки.ОтображатьЗаголовок = Ложь;
	
	ПолеВвода = Форма.Элементы.Добавить ("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("приИзменении", "СогласованнаяСкидкаПриИзмененииПосле");
	
	Команда = Форма.Команды.Добавить("ПересчитатьТпблицу");
	Команда.Действие = "СогласованнаяСкидкаПриИзмененииПосле";
	Команда.Заголовок = "Пересчитать таблицу";  
	
	Кнопка = Форма.Элементы.Добавить("ДЗ_ПересчитатьТпблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидки);
	Кнопка.ИмяКоманды = "ПересчитатьТпблицу";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели; 
	
КонецПроцедуры	
	
#КонецОбласти

